# 공학수치해석 HW2
## 32190956 김은상

## 2.7.2 

mylist2 = ['Python', 'is', 'fun']
print(mylist2)

##-----------------------------------------------------------


## 2.7.4 

import numpy as np
a = np.array([1,2,3,4,5])
print(a)

##-----------------------------------------------------------

## 2.7.6

# import numpy as np < 이미 위에서 선언했기에 재선언할 필요 없음

b = np.array([91, 92, 93, 94, 95])
c = a + b
d = a - b

print(c)

print('')
print('')
print('')

print(d)


##-----------------------------------------------------------

## 2.7.8

B = np.array([[1, 2, 99], [3, 4, 100], [5, 6, 101]])
print(B)

print('')
print('')
print('')

##-----------------------------------------------------------

## 2.7.10

b = 90

if b >= 90:
    print('A')
else  :
    print('B')

b = 89

if b >= 90:
    print('A')
else  :
    print('B')


print('')
print('')
print('')

##-----------------------------------------------------------


## MarkDown 문법

# 글자크기 

# 대제목
## 중제목
### 소제목
#### 젤 작게

#--------------------------------------------------------

# 글자체 바꾸기

# 굵은 글자체(Bold체) **원하는 문자** 
# 이텔릭채           *원하는 문자*
# 인용하기           >

#--------------------------------------------------------

# 수식표기 ( $ 사용하기 )

# 곱하기   $ 3\times4 $ => 3X4
# 아래첨자  $ x_i $
# 윗첨자    $ x^i $
# 제곱근   $ \sqrt{2} $
# 적분기호  $ \int_{여기서부터}^{여기까지} g(x) dx $ 
# 분수     $ \frac{분자}{분모}
# 문자     $ \alpha + \beta $   
# 합       $ \sum_{i= 여기서부터}^여기까지 x_i

#--------------------------------------------------------

# 방정식

# \begin{equation}
#     \alpha = \beta + 3
# \end{equation}

#--------------------------------------------------------

# 행렬표기

# \begin{equation}
# A = \begin{bmatrix}
#     1 & 2 & 3 \\
#     4 & 5 & 6 \\
#     7 & 8 & 9 
# \end{matrix}
# \end{equation}

